tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf2620_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF2620_H_
#define _PIC18LF2620_H_

#define PORTA                         0
#define ULPWUIN                       1
#define PORTA_RA0                     2
#define PORTA_RA1                     3
#define PORTA_RA2                     4
#define PORTA_RA3                     5
#define PORTA_RA4                     6
#define T0CKI                         7
#define AN4                           8
#define PORTA_RA5                     9
#define LVDIN                         10
#define nSS                           11
#define NOT_SS                        12
#define SS                            13
#define HLVDIN                        14
#define PORTA_RA6                     15
#define PORTA_RA7                     16
#define RJPU                          17
#define PORTB                         18
#define INT0                          19
#define PORTB_RB0                     20
#define AN12                          21
#define INT1                          22
#define PORTB_RB1                     23
#define AN10                          24
#define AN8                           25
#define INT2                          26
#define PORTB_RB2                     27
#define AN9                           28
#define PORTB_CCP2                    29
#define CCP2_PA2                      30
#define PORTB_RB3                     31
#define KBI0                          32
#define PORTB_RB4                     33
#define AN11                          34
#define PGM                           35
#define PORTB_RB5                     36
#define KBI1                          37
#define PGC                           38
#define PORTB_RB6                     39
#define KBI2                          40
#define PGD                           41
#define PORTB_RB7                     42
#define KBI3                          43
#define PORTC                         44
#define T13CKI                        45
#define T1CKI                         46
#define T1OSO                         47
#define PORTC_RC0                     48
#define PORTC_CCP2                    49
#define T1OSI                         50
#define PA2                           51
#define PORTC_RC1                     52
#define CCP1                          53
#define PA1                           54
#define PORTC_RC2                     55
#define SCL                           56
#define SCK                           57
#define PORTC_RC3                     58
#define SDA                           59
#define SDI                           60
#define PORTC_RC4                     61
#define SDO                           62
#define PORTC_RC5                     63
#define TX                            64
#define CK                            65
#define PORTC_RC6                     66
#define DT                            67
#define RX                            68
#define PORTC_RC7                     69
#define PORTE                         70
#define VPP                           71
#define RE3                           72
#define NOT_MCLR                      73
#define MCLR                          74
#define CCP9E                         75
#define nMCLR                         76
#define PC3E                          77
#define LATA                          78
#define LATA0                         79
#define LA0                           80
#define LATA1                         81
#define LA1                           82
#define LATA2                         83
#define LA2                           84
#define LATA3                         85
#define LA3                           86
#define LATA4                         87
#define LA4                           88
#define LATA5                         89
#define LA5                           90
#define LATA6                         91
#define LA6                           92
#define LATA7                         93
#define LA7                           94
#define LATB                          95
#define LB0                           96
#define LATB0                         97
#define LB1                           98
#define LATB1                         99
#define LB2                           100
#define LATB2                         101
#define LB3                           102
#define LATB3                         103
#define LB4                           104
#define LATB4                         105
#define LB5                           106
#define LATB5                         107
#define LB6                           108
#define LATB6                         109
#define LB7                           110
#define LATB7                         111
#define LATC                          112
#define LATC0                         113
#define LC0                           114
#define LATC1                         115
#define LC1                           116
#define LATC2                         117
#define LC2                           118
#define LATC3                         119
#define LC3                           120
#define LATC4                         121
#define LC4                           122
#define LATC5                         123
#define LC5                           124
#define LATC6                         125
#define LC6                           126
#define LATC7                         127
#define LC7                           128
#define TRISA                         129
#define TRISA0                        130
#define TRISA_RA0                     131
#define TRISA1                        132
#define TRISA_RA1                     133
#define TRISA2                        134
#define TRISA_RA2                     135
#define TRISA3                        136
#define TRISA_RA3                     137
#define TRISA_RA4                     138
#define TRISA4                        139
#define TRISA_RA5                     140
#define TRISA5                        141
#define TRISA_RA6                     142
#define TRISA6                        143
#define TRISA_RA7                     144
#define TRISA7                        145
#define TRISB                         146
#define TRISB_RB0                     147
#define TRISB0                        148
#define TRISB_RB1                     149
#define TRISB1                        150
#define TRISB_RB2                     151
#define TRISB2                        152
#define TRISB_RB3                     153
#define TRISB3                        154
#define TRISB_RB4                     155
#define TRISB4                        156
#define TRISB_RB5                     157
#define TRISB5                        158
#define TRISB_RB6                     159
#define TRISB6                        160
#define TRISB_RB7                     161
#define TRISB7                        162
#define TRISC                         163
#define TRISC0                        164
#define TRISC_RC0                     165
#define TRISC1                        166
#define TRISC_RC1                     167
#define TRISC2                        168
#define TRISC_RC2                     169
#define TRISC3                        170
#define TRISC_RC3                     171
#define TRISC4                        172
#define TRISC_RC4                     173
#define TRISC5                        174
#define TRISC_RC5                     175
#define TRISC6                        176
#define TRISC_RC6                     177
#define TRISC7                        178
#define TRISC_RC7                     179
#define OSCTUNE                       180
#define TUN0                          181
#define TUN                           182
#define TUN1                          183
#define TUN2                          184
#define TUN3                          185
#define TUN4                          186
#define PLLEN                         187
#define INTSRC                        188
#define PIE1                          189
#define TMR1IE                        190
#define TMR2IE                        191
#define CCP1IE                        192
#define SSPIE                         193
#define TXIE                          194
#define TX1IE                         195
#define RCIE                          196
#define RC1IE                         197
#define ADIE                          198
#define PIR1                          199
#define TMR1IF                        200
#define TMR2IF                        201
#define CCP1IF                        202
#define SSPIF                         203
#define TXIF                          204
#define TX1IF                         205
#define RCIF                          206
#define RC1IF                         207
#define ADIF                          208
#define IPR1                          209
#define TMR1IP                        210
#define TMR2IP                        211
#define CCP1IP                        212
#define SSPIP                         213
#define TX1IP                         214
#define TXIP                          215
#define RC1IP                         216
#define RCIP                          217
#define ADIP                          218
#define PIE2                          219
#define CCP2IE                        220
#define TMR3IE                        221
#define HLVDIE                        222
#define LVDIE                         223
#define BCLIE                         224
#define EEIE                          225
#define CMIE                          226
#define OSCFIE                        227
#define PIR2                          228
#define CCP2IF                        229
#define TMR3IF                        230
#define HLVDIF                        231
#define LVDIF                         232
#define BCLIF                         233
#define EEIF                          234
#define CMIF                          235
#define OSCFIF                        236
#define IPR2                          237
#define CCP2IP                        238
#define TMR3IP                        239
#define HLVDIP                        240
#define LVDIP                         241
#define BCLIP                         242
#define EEIP                          243
#define CMIP                          244
#define OSCFIP                        245
#define EECON1                        246
#define RD                            247
#define WR                            248
#define WREN                          249
#define WRERR                         250
#define FREE                          251
#define CFGS                          252
#define EEFS                          253
#define EEPGD                         254
#define RCSTA                         255
#define RCD8                          256
#define RX9D                          257
#define OERR                          258
#define FERR                          259
#define ADDEN                         260
#define ADEN                          261
#define CREN                          262
#define SRENA                         263
#define SREN                          264
#define RC9                           265
#define RC8_9                         266
#define RX9                           267
#define SPEN                          268
#define TXSTA                         269
#define TXD8                          270
#define TX9D1                         271
#define TX9D                          272
#define TRMT                          273
#define TRMT1                         274
#define BRGH1                         275
#define BRGH                          276
#define SENDB1                        277
#define SENDB                         278
#define SYNC                          279
#define SYNC1                         280
#define TXEN1                         281
#define TXEN                          282
#define TX91                          283
#define TX8_9                         284
#define TX9                           285
#define CSRC1                         286
#define CSRC                          287
#define T3CON                         288
#define TMR3ON                        289
#define TMR3CS                        290
#define nT3SYNC                       291
#define NOT_T3SYNC                    292
#define T3SYNC                        293
#define SOSCEN3                       294
#define T3CCP1                        295
#define T3CKPS                        296
#define T3CKPS0                       297
#define T3CKPS1                       298
#define T3CCP2                        299
#define T3CON_RD16                    300
#define RD163                         301
#define T3RD16                        302
#define CMCON                         303
#define CM                            304
#define CMEN0                         305
#define CM0                           306
#define CMEN1                         307
#define CM1                           308
#define CMEN2                         309
#define CM2                           310
#define CIS                           311
#define C1INV                         312
#define C2INV                         313
#define C1OUT                         314
#define C2OUT                         315
#define CVRCON                        316
#define CVR                           317
#define CVR0                          318
#define CVR1                          319
#define CVR2                          320
#define CVR3                          321
#define CVRSS                         322
#define CVRR                          323
#define CVROEN                        324
#define CVROE                         325
#define CVREN                         326
#define ECCP1AS                       327
#define PSSAC                         328
#define PSSAC0                        329
#define PSSAC1                        330
#define ECCPAS0                       331
#define ECCPAS                        332
#define ECCPAS1                       333
#define ECCPAS2                       334
#define ECCPASE                       335
#define PWM1CON                       336
#define PRSEN                         337
#define BAUDCON                       338
#define ABDEN                         339
#define W4E                           340
#define WUE                           341
#define BRG16                         342
#define TXCKP                         343
#define SCKP                          344
#define RXCKP                         345
#define RXDTP                         346
#define RCMT                          347
#define RCIDL                         348
#define ABDOVF                        349
#define CCP2CON                       350
#define CCP2M                         351
#define CCP2M0                        352
#define CCP2M1                        353
#define CCP2M2                        354
#define CCP2M3                        355
#define DC2B0                         356
#define CCP2Y                         357
#define DC2B                          358
#define DC2B1                         359
#define CCP2X                         360
#define CCP1CON                       361
#define CCP1M0                        362
#define CCP1M                         363
#define CCP1M1                        364
#define CCP1M2                        365
#define CCP1M3                        366
#define CCP1Y                         367
#define DC1B                          368
#define DC1B0                         369
#define CCP1X                         370
#define DC1B1                         371
#define ADCON2                        372
#define ADCS0                         373
#define ADCS                          374
#define ADCS1                         375
#define ADCS2                         376
#define ACQT0                         377
#define ACQT                          378
#define ACQT1                         379
#define ACQT2                         380
#define ADFM                          381
#define ADCON1                        382
#define PCFG0                         383
#define PCFG                          384
#define PCFG1                         385
#define PCFG2                         386
#define CHSN3                         387
#define PCFG3                         388
#define VCFG                          389
#define VCFG0                         390
#define VCFG01                        391
#define VCFG11                        392
#define VCFG1                         393
#define ADCON0                        394
#define ADON                          395
#define nDONE                         396
#define GO_nDONE                      397
#define NOT_DONE                      398
#define GODONE                        399
#define GO_DONE                       400
#define DONE                          401
#define GO_NOT_DONE                   402
#define GO                            403
#define CHS                           404
#define CHS0                          405
#define CHS1                          406
#define CHS2                          407
#define CHS3                          408
#define SSPCON2                       409
#define SEN                           410
#define RSEN                          411
#define PEN                           412
#define RCEN                          413
#define ACKEN                         414
#define ACKDT                         415
#define ACKSTAT                       416
#define GCEN                          417
#define SSPCON1                       418
#define SSPM0                         419
#define SSPM                          420
#define SSPM1                         421
#define SSPM2                         422
#define SSPM3                         423
#define CKP                           424
#define SSPEN                         425
#define SSPOV                         426
#define WCOL                          427
#define SSPSTAT                       428
#define BF                            429
#define UA                            430
#define R_NOT_W                       431
#define NOT_W                         432
#define nW                            433
#define RW                            434
#define nWRITE                        435
#define R                             436
#define W                             437
#define NOT_WRITE                     438
#define R_nW                          439
#define R_W                           440
#define START                         441
#define S                             442
#define STOP                          443
#define P                             444
#define A                             445
#define NOT_A                         446
#define nA                            447
#define D_A                           448
#define D_nA                          449
#define D                             450
#define DA                            451
#define D_NOT_A                       452
#define NOT_ADDRESS                   453
#define nADDRESS                      454
#define CKE                           455
#define SMP                           456
#define T2CON                         457
#define T2CKPS0                       458
#define T2CKPS                        459
#define T2CKPS1                       460
#define TMR2ON                        461
#define T2OUTPS0                      462
#define TOUTPS                        463
#define T2OUTPS1                      464
#define T2OUTPS2                      465
#define T2OUTPS3                      466
#define PR2                           467
#define WM0                           468
#define WM1                           469
#define WAIT0                         470
#define WAIT1                         471
#define EBDIS                         472
#define T1CON                         473
#define TMR1ON                        474
#define TMR1CS                        475
#define NOT_T1SYNC                    476
#define T1SYNC                        477
#define nT1SYNC                       478
#define T1OSCEN                       479
#define SOSCEN                        480
#define T1CKPS0                       481
#define T1CKPS                        482
#define T1CKPS1                       483
#define T1RUN                         484
#define T1CON_RD16                    485
#define T1RD16                        486
#define RCON                          487
#define BOR                           488
#define NOT_BOR                       489
#define nBOR                          490
#define POR                           491
#define nPOR                          492
#define NOT_POR                       493
#define PD                            494
#define nPD                           495
#define NOT_PD                        496
#define NOT_TO                        497
#define nTO                           498
#define TO                            499
#define nRI                           500
#define NOT_RI                        501
#define RI                            502
#define SBOREN                        503
#define IPEN                          504
#define WDTCON                        505
#define SWDTE                         506
#define SWDTEN                        507
#define HLVDCON                       508
#define HLVDL                         509
#define HLVDL0                        510
#define LVV0                          511
#define LVDL0                         512
#define HLVDL1                        513
#define LVDL1                         514
#define LVV1                          515
#define HLVDL2                        516
#define LVV2                          517
#define LVDL2                         518
#define HLVDL3                        519
#define LVV3                          520
#define LVDL3                         521
