tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf2620_tdd.h
#define HLVDEN                        522
#define LVDEN                         523
#define BGST                          524
#define IRVST                         525
#define IVRST                         526
#define VDIRMAG                       527
#define OSCCON                        528
#define SCS0                          529
#define SCS                           530
#define SCS1                          531
#define IOFS                          532
#define OSTS                          533
#define IRCF                          534
#define IRCF0                         535
#define IRCF1                         536
#define IRCF2                         537
#define IDLEN                         538
#define T0CON                         539
#define T0PS                          540
#define T0PS0                         541
#define T0PS1                         542
#define T0PS2                         543
#define PSA                           544
#define T0SE                          545
#define T0CS                          546
#define T08BIT                        547
#define T016BIT                       548
#define TMR0ON                        549
#define STATUS                        550
#define C                             551
#define CARRY                         552
#define DC                            553
#define ZERO                          554
#define Z                             555
#define OV                            556
#define OVERFLOW                      557
#define N                             558
#define NEGATIVE                      559
#define INTCON3                       560
#define INT1IF                        561
#define INT1F                         562
#define INT2IF                        563
#define INT2F                         564
#define INT1E                         565
#define INT1IE                        566
#define INT2IE                        567
#define INT2E                         568
#define INT1P                         569
#define INT1IP                        570
#define INT2IP                        571
#define INT2P                         572
#define INTCON2                       573
#define RBIP                          574
#define TMR0IP                        575
#define INTEDG2                       576
#define INTEDG1                       577
#define INTEDG0                       578
#define RBPU                          579
#define NOT_RBPU                      580
#define nRBPU                         581
#define INTCON                        582
#define RBIF                          583
#define INT0F                         584
#define INT0IF                        585
#define T0IF                          586
#define TMR0IF                        587
#define RBIE                          588
#define INT0E                         589
#define INT0IE                        590
#define T0IE                          591
#define TMR0IE                        592
#define PEIE                          593
#define PEIE_GIEL                     594
#define GIEL                          595
#define GIE_GIEH                      596
#define GIE                           597
#define GIEH                          598
#define STKPTR0                       599
#define STKPTR                        600
#define SP0                           601
#define STKPTR1                       602
#define SP1                           603
#define STKPTR2                       604
#define SP2                           605
#define SP3                           606
#define STKPTR3                       607
#define STKPTR4                       608
#define SP4                           609
#define STKUNF                        610
#define STKOVF                        611
#define STKFUL                        612

#endif // _PIC18LF2620_H_
